[
  {
    "name": "SWE Intern @ Redgate",
    "description": "At Redgate Software, I worked as a Software Engineer Intern, joining Team Polymon to work on the Redgate Monitor product. Here I gained valuable professional experience in software development, and learned how to navigate a large legacy codebase, especially when debugging and solving user stories.",
    "date": "Jun-Sep 2025",
    "tags": [
      "Internship",
      "Software Engineering",
      "DevOps"
    ],
    "url": "https://www.red-gate.com/",
    "image": "redgate.png"
  },
  {
    "name": "PintOS",
    "description": "At Imperial College London, I worked on a group project, creating a simple operating system called PintOS. This project involved implementing various components of the OS, such as process management, file systems, and virtual memory. ",
    "date": "Oct-Dec 2024",
    "tags": [
      "Operating Systems",
      "C",
      "Coursework"
    ],
    "url": "https://www.imperial.ac.uk/computing/current-students/course-admin/noticeboards/second-year/labs/os-lab-project/",
    "image": "ic_labs.jpg"
  },
  {
    "name": "Sustainapod",
    "description": "As Website Development Lead at Sustainapod, I worked closely with the team and founders to create a website that showcases our mission to promote sustainability and environmental awareness, bringing youth into the green sector. As part of this I particicpated in the Climate Pre-Accelerator Program at Imperial in 2024.",
    "date": "Oct 2023 - Present",
    "tags": [
      "Web Development",
      "Sustainability",
      "Startup"
    ],
    "url": "https://www.sustainapod.co.uk/",
    "image": "sustainapod.jpg"
  },
  {
    "name": "Dancelot",
    "description": "During the summer of 2024, I worked with Sani Abubakar to create a website application using NodeJS, NextJS and Python scripts to allow users to follow along to YouTube dance videos and get scores, similar to Just Dance. This is achieved via MediaPipe's pose landmark detection models, where the landmarks are detected in real-time as well as for the video that the user provides.",
    "date": "Jul-Sep 2024",
    "tags": [
      "Web Development",
      "Computer Vision",
      "MediaPipe"
    ],
    "url": "https://github.com/TFF-Projects/dancelot",
    "image": "pose_estimation.png"
  },
  {
    "name": "XonT",
    "description": "XonT is a tool for game developers to be able to generate 3D model assets using AI, that users can then import into game engines such as Unity. This was a hackathon project undertaken by myself, Alexander Biraben-Renard, Mohammad Abbas, Sani Abubakar and Lawan Fathullah, for the Encode Club London AI Hackathon in March 2024, where we won £1000 as the runner ups to Virtual Protocol's bounty.",
    "date": "March 2024",
    "tags": [
      "AI",
      "Game Development",
      "Hackathon"
    ],
    "url": "https://github.com/alexanderbira/XonT",
    "image": "encode.webp"
  }
]